In [14]:
import pandas as pd
import sqlalchemy as sql
from sqlalchemy import MetaData
from config import db_uri

In [15]:
engine = sql.create_engine(db_uri)
engine

Engine(mysql://root:***@localhost/python_exercise_2)

In [16]:
data_owner = pd.read_sql_table('owner', engine)
data_puppies = pd.read_sql_table('puppies', engine)

In [17]:
data_owner

  owner_name          address           city state  zipcode
0       marc       120 elm st          miami    fl    30050
1      frank  151 johnson ave         austin    tx    77102
2      maria   746 clinton ct   philadelphia    pa    11203
3     joanne    12003 main st     littletown    ks    20303
4      miles    12034 main rd      smalltown    ms    24455
5       luke    74847 left ln        seattle    wa    98748
6      moses     836 ocean dr  san francisco    ca    98288
7     hannah     89 pines ave    albuquerque    nm    11253
8      sarah    345 valley st        phoenix    az    87989
9       joel      76 river rd     des moines    ia    56433

In [18]:
data_puppies

    owner_id puppy_name  age  gender  height_inches   color  favorite_food
0          1       wake    9  female             13    gray       dry food
1          1    yangoon    6    male             40    gray       dry food
2          2      keans    3  female             39   black    beef jerkey
3          2       reno    8  female             10    gray  chicken bites
4          3     oregon    0  female             13   brown    lamb treats
5          3     eugene   10    male             12    gray    lamb treats
6          4    nogales   12  female             18    gray    beef jerkey
7          4     wilkes    1  female             39   black  chicken bites
8          5    raleigh    7  female             12  golden       dry food
9          5      eagle    3    male             27    gray    beef jerkey
10         6     oakley    2    male             47  golden    lamb treats
11         6      nampa    7  female             45   beige    beef jerkey
12         7      young    5    male             32   white    lamb treats
13         7  kalamazoo    7  female             38    gray  chicken bites
14         8     edison    5    male             21    gray    lamb treats
15         8      wayne   11  female             17  golden    lamb treats
16         9     newton   11    male             36   beige    beef jerkey
17         9       yuma    1    male             43   beige    beef jerkey
18        10     orange    2  female             32   beige       dry food
19        10    reedley    6  female             30   beige    beef jerkey

In [19]:
data_owner['owner_name'] = data_owner['owner_name'].str.capitalize()
data_owner['address'] = data_owner['address'].str.title()
data_owner['city'] = data_owner['city'].str.title()
data_owner['state'] = data_owner['state'].str.upper()

In [20]:
data_owner

  owner_name          address           city state  zipcode
0       Marc       120 Elm St          Miami    FL    30050
1      Frank  151 Johnson Ave         Austin    TX    77102
2      Maria   746 Clinton Ct   Philadelphia    PA    11203
3     Joanne    12003 Main St     Littletown    KS    20303
4      Miles    12034 Main Rd      Smalltown    MS    24455
5       Luke    74847 Left Ln        Seattle    WA    98748
6      Moses     836 Ocean Dr  San Francisco    CA    98288
7     Hannah     89 Pines Ave    Albuquerque    NM    11253
8      Sarah    345 Valley St        Phoenix    AZ    87989
9       Joel      76 River Rd     Des Moines    IA    56433

In [21]:
owner_count_rows = 'Number of records in \'owner\' table:  ' + str(len(data_owner))
owner_count_rows

"Number of records in 'owner' table:  10"

In [22]:
owner_count_columns = 'Number of columns in \'owner\' table:  ' + str(data_owner.count(axis = 1)[0])
owner_count_columns

"Number of columns in 'owner' table:  5"

In [23]:
data_puppies['puppy_name'] = data_puppies['puppy_name'].str.title()
data_puppies['age'] = data_puppies['age'].astype(int)
data_puppies['favorite_food'] = data_puppies['favorite_food'].str.title()

In [24]:
data_puppies

    owner_id puppy_name  age  gender  height_inches   color  favorite_food
0          1       Wake    9  female             13    gray       Dry Food
1          1    Yangoon    6    male             40    gray       Dry Food
2          2      Keans    3  female             39   black    Beef Jerkey
3          2       Reno    8  female             10    gray  Chicken Bites
4          3     Oregon    0  female             13   brown    Lamb Treats
5          3     Eugene   10    male             12    gray    Lamb Treats
6          4    Nogales   12  female             18    gray    Beef Jerkey
7          4     Wilkes    1  female             39   black  Chicken Bites
8          5    Raleigh    7  female             12  golden       Dry Food
9          5      Eagle    3    male             27    gray    Beef Jerkey
10         6     Oakley    2    male             47  golden    Lamb Treats
11         6      Nampa    7  female             45   beige    Beef Jerkey
12         7      Young    5    male             32   white    Lamb Treats
13         7  Kalamazoo    7  female             38    gray  Chicken Bites
14         8     Edison    5    male             21    gray    Lamb Treats
15         8      Wayne   11  female             17  golden    Lamb Treats
16         9     Newton   11    male             36   beige    Beef Jerkey
17         9       Yuma    1    male             43   beige    Beef Jerkey
18        10     Orange    2  female             32   beige       Dry Food
19        10    Reedley    6  female             30   beige    Beef Jerkey

In [26]:
puppies_count_rows = 'Number of records in \'puppies\' table:  ' + str(len(data_puppies))
puppies_count_rows

"Number of records in 'puppies' table:  20"

In [27]:
puppies_count_columns = 'Number of columns in \'puppies\' table:  ' + str(data_puppies.count(axis = 1)[0])
puppies_count_columns

"Number of columns in 'puppies' table:  7"

In [28]:
data_puppies['age'] = data_puppies['age'].astype(int)
puppies_groupby_attribute = data_puppies.groupby(['color']).size()
puppies_groupby_attribute

color
beige     5
black     2
brown     1
golden    3
gray      8
white     1
dtype: int64